// 1. Скільки буде 1+1? -------------------------2
// 2. Скільки буде 10*7?-------------------------70
// 3. Який сьогодні місяць?----------------------7
// 4. Який сьогодні рік?-------------------------2022
// 5. Скільки в році місяців?--------------------12
// 6. Яка ціна проїзду в маршрутці?--------------15
// 7. А в тролейбусі?----------------------------10
// 8. Рік заснування міста Лева?-----------------1256
// 9. День незалежності України __ серпня.-------24
// 10. Яка ціна бензину?-------------------------51



function exs_2_1() {

    let a = 0;

    let q1 = prompt('Скільки буде 1+1?');
        if (q1 == 2) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        };
    let q2 = prompt('Скільки буде 10*7?');
        if (q2 == 70) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        };

    let q3 = prompt('Який сьогодні місяць?');
        if (q3 == 7 || q3 ==07) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q4 = prompt('Який сьогодні рік?');
        if (q4 == 2022) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q5 = prompt('Скільки в році місяців?');
        if (q5 == 12) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q6 = prompt('Яка вартість проїзду в маршрутці?');
        if (q6 == 15) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q7 = prompt('А в тролейбусі?');
        if (q7 == 10) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q8 = prompt('Рік заснування міста Лева?');
        if (q8 == 1256) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q9 = prompt('День незалежності України __ серпня.');
        if (q9 == 24) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        }
    let q10 = prompt('Яка вартість бензину?');
        if (q10 == 51) {
            console.log("Правильно +1");
            a++ ;
        }
        else {
            console.log("Неправильно");
        };

    let qFinish = ('Ваш результат:') ;
        if (a >= 0 && a < 4 ) {
            alert(`Ваш результат: "${a}" <<Двоїшник>>`)
        }
        else if (a >= 4 && a < 7) {
            alert(`Ваш результат: "${a}" <<Задовільно>>`)
        }
        else if (a >= 7 && a < 9) {
            alert(`Ваш результат: "${a}" <<Добре>>`)
        }
        else if (a >= 9 && a < 11) {
            alert(`Ваш результат: "${a}" <<Відмінно>>`)
        };

    console.log(qFinish,a);

}

// =====================================================

function exs_2_2() {

    let userName = prompt("Введіть ім'я");

    if (userName == 'Міша') {
        let parol =  prompt('Введіть пароль');
    
        if (parol == 'ЛОГОС') {
            alert ('Ласкаво просимо')
        }
        else if (parol == null) {
            alert ('Вхід скасовано');
        }
        else {
            alert('Пароль невірний');
        }
    }
    else if (userName == null) {
        alert ('Вхід скасовано');
    }
    else  {
        alert('Я вас не знаю');
    }
}


// ====================================================

function exs_2_3() {

    let a = +prompt('Введіть число');

    if (a >= 3 && a < 6) {
        alert ('Весна')
    }
    else if (a >=6 && a <9) {
        alert('Літо')
    }
    else if (a >=9 && a < 12) {
        alert('Осінь')
    }
    else if (a > 0 && a < 3 || a == 12 ) {
        alert ('Зима')
    }
    else {
        alert('Введіть число від 1 до 12')
    }

}