
// =========================================================

// Завдання 1
// Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.


function exs3_1() {

  let f = prompt('Введіть число');

  let j = 1;

  for(let i = 2; i <= f; i++) {
    j = j*i;
  }

  alert(j);

}



// ============================================================


//  Завдання 2
// Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999


function exs3_2() {

  for (let i = 1000; i <= 9999; i+=3) {
    console.log(i);
  }

}


// ============================================================



//  Завдання 3
// Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 …


function exs3_3() {

  for (i = 1, j = 1; j <= 55; j++, i += 2) {
      console.log(i);
  }

}


// =============================================================



// Завдання 4
// Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 …

function exs3_4() {

  for (let i = 90; i >= 0; i-=5) {
      console.log(i);
  }

}




// =============================================================



// Завдання 5
// Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 …


function exs3_5() {

  for (i = 1, j=2; i <= 20; i++, j*=2) {
      console.log(j);
  }

}




// =============================================================



// Завдання 6
// Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.


function exs3_6() {

  for(let a = 2; a <= 10000; a = 2*a - 1) {
      console.log(a);
  }

}



// =============================================================




// Завдання 7
// Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), де початкове значення змінної a = -166


function exs3_7() {

  for (a = -166; a < 100; a = 2*a + 200) {
      if(a > -100 && (a <-9 || a > 9)) {
          console.log(a);
      }
  }

}



// =============================================================



// Завдання 8
// Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл! 
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;



function exs3_8() {

  let a = prompt("Число");
  let b = prompt("Степінь")

  let n = a;

  for (let i = 1; i < b; i++) {
    n *= a;
  }


  alert(n);
}

