


function exs_4_1() {

    let radius = +prompt('Введіть радіус');
    let a = 2 * Math.PI * radius;
    console.log(`Площа круга : ${a}`);
    alert(`Площа круга : ${a}`);
}


// ===========================================================



function exs_4_2() {

    let a = +prompt("Введіть число");

    let n = Math.sqrt(a);

    if (n = Math.sqrt(a)) {
        alert(`Квадратний корінь числа ${a}  - "${n}"`);
    }
    else if (a < 0) {
        alert(`Введіть додатнє число!`);
    }
    else if (a == "") {
        alert(`Будь ласка, введіть число!`);
    }
    else {
        alert(`Повинно бути числове значення!`);
    }
}



// ============================================================




